Revit 2027 API
FilterStringRule Constructor
 Constructs an instance of FilterStringRule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FilterStringRule(
	FilterableValueProvider valueProvider,
	FilterStringRuleEvaluator evaluator,
	string ruleString
)
Public Sub New (
	valueProvider As FilterableValueProvider,
	evaluator As FilterStringRuleEvaluator,
	ruleString As String
)
public:
FilterStringRule(
	FilterableValueProvider^ valueProvider,
	FilterStringRuleEvaluator^ evaluator,
	String^ ruleString
)
new :
        valueProvider : FilterableValueProvider *
        evaluator : FilterStringRuleEvaluator *
        ruleString : string -> FilterStringRule
Parameters
valueProvider FilterableValueProvider
 A pointer to a "value provider" object that will extract values from a Revit document.
evaluator FilterStringRuleEvaluator
 A pointer to the filter rule evaluator object that implements the desired test. The built-in evaluators implement commonly used tests for strings such as begins-with, ends-with, contains, equal, etc.
ruleString String
 The user-supplied string against which strings from a Revit document will be tested.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FilterStringRule Class
Autodesk.Revit.DB Namespace